<template>
  <v-container class="post">
    <v-row>
      <v-col
        cols="12"
        sm="8"
        offset-sm="2"
      >
        <h1 class="display-2 mt-10">
          Простейший рецепт нитрата NO<sub>3</sub>
        </h1>
        <h2 class="title font-weight-regular mb-6">
          самодельное удобрение с нитратом для растительного аквариума
        </h2>
        <div class="subtitle-2">
          Автор: Михаил Лапшин
        </div>
        <div class="subtitle-2 mb-10">
          Дата последнего обновления: 8 Апреля 2023
        </div>

        <v-alert
          type="success"
          prominent
          text
          :icon="false"
          class="mb-6"
        >
          Для тех, кто хочет создать более сложный рецепт, есть основная
          <nuxt-link to="/recipes">
            страница
          </nuxt-link>
          с рецептами.
        </v-alert>

        <p class="mb-10">
          Данная статья посвящена самому простому рецепту жидкого удобрения, содержащего нитрат.
          Я постараюсь объяснить общую логику создания самодельного удобрения с нитратом и
          показать, что это может сделать абсолютно любой аквариумист без каких-либо
          знаний химии.
        </p>

        <v-row class="mb-6">
          <v-col cols="10">
            <v-alert
              type="info"
              :icon="false"
              shaped
              text
              class="mb-0"
            >
              Я: У меня в школе была тройка по химии. Она меня пугает.
              Объясни мне самые-самые основы, пожалуйста!
            </v-alert>
          </v-col>
          <v-col
            cols="10"
            offset="2"
          >
            <v-alert
              type="success"
              :icon="false"
              shaped
              text
            >
              Автор: С удовольствием! Сейчас подробно объясню.
            </v-alert>
          </v-col>
        </v-row>

        <p>
          В этой статье я хочу дать не просто рецепт нитрата, который можно будет использовать
          в своем аквариуме, а дать понимание того, что рецепт - это не что-то неизменное,
          от чего нельзя отступать. И этот рецепт далеко <b>не единственный</b>!
          Если вы измените концентрацию нитрата в удобрении в чужом рецепте, это не
          испортит рецепт, но сделает более удобным подбор дозировок нитрата <b>именно для вашего</b> объема аквариума.
        </p>

        <p class="mb-10">
          Для совсем новичков и совсем не химиков, давайте дадим самое простое понимание концентрации,
          на сколько это возможно:
        </p>

        <v-alert
          type="info"
          text
          class="mb-10"
        >
          Концентрация - это то на сколько много содержится
          удобрения в вашей таре, на сколько оно “ядреное” или разбавленное.
        </v-alert>

        <p>
          Концентрация влияет на порцию удобрения, которую вы будете заливать в аквариум.
          Эта порция называется дозировкой или дозой. Когда говорят о дозировках, то
          обычно это несколько <b>мл</b> в день или несколько десятков мл в неделю.
        </p>

        <p>
          Если у вас маленький аквариум, но при этом сильно концентрированное удобрение,
          то вам придется подавать удобрение очень маленькими дозами из инсулинового шприца или из пипетки, особенно
          если вы предполагаете подачу удобрений каждый день. В этом случае
          намешав целый литр удобрений, но подавая всего 1 мл даже каждый день, вы рискуете
          тем, что удобрение быстрее испортится, чем вы его израсходуете. А так как удобрение
          скорее всего будет замешиваться без сильного консерванта, то через 2-3 месяца вы увидите
          в банке плесень или белый грибок 🤢
        </p>

        <p>
          В обратной ситуации, если у вас очень большой аквариум, но удобрение с маленькой
          концентрацией (слишком разбавленное), то вам придется делать очень большие дозировки
          и часто готовить новое удобрение. Литр вашего удобрения закончится за пару
          недель и снова придется замешивать новый объем. Это может быстро утомить.
        </p>

        <p>
          Возвращаясь к определению концентрации, хочу добавить, что она измеряется в следующих
          единицах: в удобрении <b>г/л</b>, в аквариуме <b>мг/л</b>. Проще говоря,
          если взять 100 грамм сахара и развести в одном литре воды, то вы получите удобрение
          из сахара с концентрацией 100 г/л. Так же удобрение можно называть водным раствором сахара,
          т.к. вы растворили сахар в воде 🙃
        </p>

        <p class="mb-10">
          Теперь переходим к делу. Ставший классическим - рецепт,
          <a href="https://web.archive.org/web/20131206073940/http://www.aqua-botanic.ru/index.html ">рецепт</a>
          с сайта Aqua Botanic выглядит следующим образом:
        </p>

        <v-alert
          type="info"
          text
          icon="mdi-receipt-text"
          class="mb-10"
        >
          82.88 грамма нитрата калия (KNO3 или калиевая селитра) на 1000 мл.
        </v-alert>

        <p>
          Не могу знать первоначальную логику создания данного удобрения, но выглядит так, что этот
          рецепт был подобран таким образом, чтобы 1 мл раствора повышал уровень нитрата на 0.5 мг/л
          в аквариуме объемом 100 литров. С точки зрения подбора дозировки вполне хороший вариант.
          Но если у вас аквариум другого объема, например, 72 литра, то дозировка составит 0.72 мл,
          для повышения уровня нитрата на те же 0.5 мг/л. Такими цифрами оперировать в голове гораздо
          сложнее, чем кратными 100, и еще неудобно вводить такой дробный объем из шприца.
        </p>

        <p>
          Хочу обратить внимание, что если вы измените первоначальный рецепт, растворив половину
          данной массы (41.44 г), то это удобрение будет работать
          точно так же, как и в оригинальном рецепте! Просто концентарция уменьшится в два раза. И нет
          никакого особенного химического процесса, который ни в коем случае нельзя нарушать.
        </p>

        <p>
          Разница будет только в том, что 1 мл будет повышать нитрат в аквариуме не на 0.5 мг/л, а на 0.25 мг/л.
          Таким образом, можно сделать рецепт с концентрацией, которая удобна для использования
          именно в <b>вашем</b> аквариуме и с тем объемом, который вы израсходуете до того, как удобрение
          испортится, т.е. регулировать “ядреность” удобрения <b>самостоятельно</b>.
        </p>

        <p class="mb-10">
          А чтобы это сделать, вам достаточно воспользоваться формой ниже. Для этого просто
          введите объем своего аквариума, объем удобрения и ту дозировку, которая вам удобна. Все!
        </p>

        <v-row>
          <v-col
            cols="12"
            md="10"
            offset-md="1"
          >
            <number-field
              v-model="tankVolume"
              @input="inputTankVolume"
              label="Объем аквариума"
              suffix="л"
              outlined
            />
            <number-field
              v-model="fertilizerVolume"
              @input="inputFertilizerVolume"
              label="Объем удобрения"
              suffix="мл"
              outlined
            />
            <v-radio-group
              v-model="toggleDose"
              row
              class="mt-0"
            >
              <v-radio
                v-for="dose in doseExamples"
                :key="dose"
                :label="`${dose} мг/л`"
                :value="dose"
              />
            </v-radio-group>
            <number-field
              v-model="fertilizerDose.NO3"
              label="Дозировка"
              suffix="мг/л"
              outlined
              :precision-show="3"
              :precision-value="5"
            />
            <number-field
              v-model="reagentMass"
              label="Масса нитрата калия"
              suffix="г"
              outlined
              :precision-show="2"
              :precision-value="2"
              :error="(reagentMass / fertilizerVolume) * 1000 > FORMULAS.KNO3.solubilityLimit"
              :error-messages="
                (reagentMass / fertilizerVolume) * 1000 > FORMULAS.KNO3.solubilityLimit
                  ? `Достигнута максимальная растворимость - ${FORMULAS.KNO3.solubilityLimit} г/л при 20°С!`
                  : ''
              "
            />
          </v-col>
        </v-row>

        <v-alert
          type="success"
          icon="mdi-receipt-text"
          class="mb-10"
        >
          Рецепт:
          <br><br>
          {{ reagentMass ? reagentMass.toFixed(2) : '-' }} г нитрата калия (KNO3) на {{ fertilizerVolume }} мл.
          <br><br>
          1 мл данного удобрения повышает уровень нитрата на
          {{ fertilizerDose.NO3 ? fertilizerDose.NO3.toFixed(2) : '-' }} мг/л и калия на
          {{ fertilizerDose.K ? fertilizerDose.K.toFixed(2) : '-' }} мг/л в аквариуме объемом
          {{ tankVolume }} л
        </v-alert>

        <v-row class="mb-6">
          <v-col cols="10">
            <v-alert
              type="info"
              :icon="false"
              shaped
              text
              class="mb-0"
            >
              Я: “Стоп-стоп-стоп! Калий?! Мы же готовили удобрение только с нитратом!”
            </v-alert>
          </v-col>
          <v-col
            cols="10"
            offset="2"
          >
            <v-alert
              type="success"
              :icon="false"
              shaped
              text
            >
              Да, побочным элементом в данном рецепте будет калий,
              потому что он содержится в реагенте - нитрате калия, и поэтому уровень калия
              будет увеличиваться при добавлении данного удобрения.
            </v-alert>
            <v-alert
              type="success"
              :icon="false"
              shaped
              text
            >
              Исходя из условий вашего аквариума, это может быть как плюсом, так и минусом.
            </v-alert>
            <v-alert
              type="success"
              :icon="false"
              shaped
              text
            >
              Но это выходит за рамки данной статьи. По поводу калия мы поговорим позже.
            </v-alert>
          </v-col>
        </v-row>

        <p>
          Поздравляю! В это сложно поверить, но вы создали свой собственный рецепт, который работает точно так же, как и
          знаменитый рецепт, только он еще и удобен лично для вас!
        </p>

        <p class="mb-15">
          Хорошая работа 👍 Осталось только приготовить этот рецепт.
        </p>
      </v-col>
    </v-row>
  </v-container>
</template>

<script>
import FORMULAS from '~/helpers/constants/formulas';
import { convertIonRatio, countPercent, convertIonName } from '@/helpers/funcs/funcs';

export default {
  name: 'SimplestNitratePage',
  head() {
    return {
      title: 'Самый простой рецепт самодельного удобрения с нитратом',
      meta: [
        {
          description: 'В этой статье вы узнаете как сделать рецепт удобрения с нитратом и калием (самомес нитрата). '
            + 'И что на самом деле это совсем не сложно.',
        },
        { keywords: 'нитрат, удобрение, самомес, монораствор, рецепт' },
        { author: 'Михаил Лапшин' },
      ],
    };
  },
  data() {
    return {
      FORMULAS,
      tankVolume: 100,
      fertilizerVolume: 1000,
      reagentMass: null,
      fertilizerDose: {
        NO3: null,
        K: null,
      },
      toggleDose: 0.5,
      doseExamples: [0.25, 0.5, 1.00],
    };
  },
  watch: {
    toggleDose: {
      immediate: true,
      handler(value) {
        this.fertilizerDose.NO3 = value;
      },
    },
    reagentMass() {
      this.countDose();
    },
    'fertilizerDose.NO3': {
      immediate: true,
      handler() {
        this.countReagentMass();
      },
    },
  },
  methods: {
    countPercent,
    convertIonRatio,
    convertIonName,
    countDose() {
      const { ions } = FORMULAS.KNO3;
      Object.entries(ions).forEach(([ion, data]) => {
        if (data.isNeeded) {
          this.fertilizerDose[this.convertIonName(ion)] = (
            (this.reagentMass / this.fertilizerVolume / this.tankVolume)
            * (this.countPercent('KNO3')[ion] * this.convertIonRatio(ion) * 1000)
          );
        }
      });
    },
    countReagentMass() {
      this.reagentMass = (this.fertilizerDose.NO3 * this.tankVolume * this.fertilizerVolume)
        / 1000 / this.countPercent('KNO3').N / this.convertIonRatio('N');
    },
    inputTankVolume(value) {
      if (+value) {
        this.countReagentMass();
      }
    },
    inputFertilizerVolume(value) {
      if (+value) {
        this.countReagentMass();
      }
    },
  },
};
</script>

<style lang="sass" scoped>
.post
  .post__title
    font-family: "Lexend", sans-serif !important
</style>
