<!--
  Samomes

  Copyright (C) 2025 Mikhail Lapshin

  This work is licensed under the Creative Commons Attribution-NonCommercial-ShareAlike 4.0
  International License. To view a copy of this license, visit
  http://creativecommons.org/licenses/by-nc-sa/4.0/ or send a letter to
  Creative Commons, PO Box 1866, Mountain View, CA 94042, USA.

  You are free to:
  - Share — copy and redistribute the material in any medium or format
  - Adapt — remix, transform, and build upon the material

  Under the following terms:
  - Attribution — You must give appropriate credit
  - NonCommercial — You may not use the material for commercial purposes
  - ShareAlike — If you remix, transform, or build upon the material,
    you must distribute your contributions under the same license as the original

  No warranties are given. The license may not give you all of the permissions
  necessary for your intended use.
-->

<template>
  <v-container class="post">
    <v-row>
      <v-col>
        <NuxtImg
          src="/images/no-tests/15.jpeg"
          class="full-width-image"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          :placeholder="[50, 25, 75, 5]"
        />
      </v-col>
    </v-row>
    <v-row>
      <v-col
        cols="12"
        md="8"
        offset-md="2"
      >
        <v-btn
          color="primary"
          class="mr-0"
          square
          :to="localePath('/articles/')"
        >
          <v-icon>mdi-chevron-left</v-icon> Все статьи
        </v-btn>
      </v-col>
      <v-col
        cols="12"
        md="8"
        offset-md="2"
      >
        <h1 class="text-h4 text-md-h3 mt-md-10">
          Тесты для аквариума вам не нужны. Часть 2
        </h1>
        <h2 class="title font-weight-regular mb-6">
          Детальный обзор тестов и заключение
        </h2>
        <div class="subtitle-2">
          Михаил Лапшин
        </div>
        <div class="subtitle-2 mb-10">
          21 мая 2025
        </div>

        <h3 class="text-body-1 font-italic font-weight-regular text-right my-10">
          “Безумие — делать одно и то же снова и снова, и ждать при этом разных результатов.”
          <br>
          Альберт Эйнштейн
        </h3>

        <p>
          <nuxt-link
            :to="localePath('/articles/no-tests-part-1/')"
            class="text-h5"
          >
            Читать начало статьи
          </nuxt-link>
        </p>

        <p class="mb-10">
          Данная статья является продолжением первой части с одноименным названием
          "Тесты для аквариума вам не нужны". Если вы попали сюда, не читая первую
          часть, то я настоятельно рекомендую перейти по
          <nuxt-link
            :to="localePath('/articles/no-tests-part-1/')"
          >
            этой ссылке
          </nuxt-link>, чтобы сначала ознакомиться с ней.
        </p>

        <p>
          Давайте рассмотрим каждый тест в отдельности, чтобы лучше представлять, о чем идет речь. Я расположил их в
          порядке от относительно полезных до бесполезных или даже вредных.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          TDS метр
        </h2>

        <p>
          Чем опытнее становится аквариумист, тем чаще он использует TDS-метр (Total Dissolved Solids — общее содержание
          растворённых веществ). Это небольшой электронный прибор, измеряющий общую электропроводность воды.
        </p>

        <p>
          Само по себе измерение TDS практически ничего не даёт новичку. Под электропроводностью понимается сумма всех
          ионов, содержащихся в воде: соли кальция, магния, удобрения, продукты жизнедеятельности рыб и так далее. Ну
          какие вообще можно сделать выводы, если вы увидели на приборе значение 150 или 200 ppm?
        </p>

        <p>
          Многие считают, что TDS-метр нужен только для определения состояния осмотической мембраны в фильтрующей
          установке. Якобы вы контролируете показатели после мембраны, и когда значение TDS повышается —
          пора её менять. И больше он ни для чего не годен.
        </p>

        <p>
          Но это не совсем так. Почему я ссылаюсь на опытного аквариумиста? Потому что только опытный может заметить или
          заподозрить изменения в аквариуме на основе такого суммарного показателя. Важно не абсолютное значение как
          таковое, а именно его изменение. Опытный аквариумист хорошо знает состав воды (или поведение) в своём
          аквариуме: какая у него вода, как он её подготавливает, сколько элементов добавляет с удобрениями, как
          реагируют его декорации при подаче CO₂ и так далее. Когда он погружает прибор в воду, то видит уже привычную
          ему цифру.
        </p>

        <p>
          Но случаются ситуации, когда показания вдруг сильно отличаются от обычных. Это хороший сигнал, что произошли
          какие-то изменения, способные привести к проблемам. Именно опытный аквариумист, наблюдая за поведением
          растений и хорошо понимая общую ситуацию в аквариуме, может с хорошей точностью провести расследование и
          выявить причину.
        </p>

        <p>
          Еще раз подчеркну: анализирующий аквариумист знает, что он делает изо дня в день, из недели в неделю. Под
          опытом я подразумеваю именно содержание растительного аквариума с дополнительной подачей CO₂. Если у вас был
          аквариум с рыбками и растениями без CO₂, то это может быть хорошим дополнением, но полноценным опытом для
          содержания подводного сада его сложно назвать. И здесь важнее не количество лет, а качество опыта. У такого
          аквариумиста нет непредсказуемых процессов, поэтому он может сразу заподозрить по общему показателю TDS, что
          что-то идет не так.
        </p>

        <p>
          Даже просто опустив TDS-метр в незнакомую воду, опытный аквариумист получает отправную точку. Как это было у
          меня с водопроводной водой: я получил значение 32 ppm. Зная, сколько примерно даёт в ppm та или иная
          жесткость, я предположил, что Kh будет 0-1, Gh 1-2. Я отказался от капельных тестов, но подписчики моего
          <a
            target="_blank"
            href="https://www.youtube.com/@lapshinmr"
          >
            Youtube-канала
          </a> попросили меня сделать измерения, и я проверил Kh и Gh. Именно такие значения и
          оказались в моей исходной воде.
        </p>

        <p>
          Хорошо, согласен, разложить на составляющие 32 ppm — не такая уж сложная задача. Но если у вас вода со
          значением 200 ppm, и вы знаете, что в вашем регионе есть аквариумисты с хорошими травниками, то с большой
          долей вероятности можно предположить, что вода будет обычной и будет иметь жесткость в
          пределах 3-4 Kh и 7-8 Gh. То есть к этому измерению мы прикладываем наши знания,
          собранную информацию и делаем приблизительный вывод.
        </p>

        <p>
          Приведу еще пример с моей водой. После дождя я заметил, что в чайнике образуется сильный белый налет. Это
          подтолкнуло меня измерить TDS воды. И каково было моё удивление — прибор показал более 200 ppm! Теперь я
          набираю воду заранее, когда этот показатель находится в районе 30 ppm.
        </p>

        <p>
          Если мы говорим об аквариуме на реминерализованной осмосной воде, то достаточно опустить TDS-метр после
          подмены, и вы уже уверены, что с количеством реминерализатора не ошиблись. Так делают многие известные
          аквариумисты с мировым именем. Некоторые даже не взвешивают соли, а просто добавляют их в аквариум до
          достижения определенного значения TDS.
        </p>

        <p>
          По суммарному значению TDS мы можем судить об общей минерализации аквариума. Как правило, мы чаще видим
          хорошие аквариумы с TDS около 150 ppm или ниже и реже — с TDS выше 200 ppm.
        </p>

        <p>
          К дополнительным преимуществам этого прибора можно отнести то, что новичку сложно навредить аквариуму,
          опираясь на его показания. Трудно начать менять что-то, если вы плохо представляете, что именно измеряете. Но
          всё же поводов лишний раз понервничать он может дать — это всё-таки тест. И если вы довольно мнительный
          человек, то это определённый минус.
        </p>

        <p>
          Начинающему аквариумисту TDS-метр может ничего не дать сразу, но привыкать к его использованию можно начать с
          первых шагов. Моя рекомендация — иметь такой прибор. Только желательно приобрести более-менее качественную
          модель, а не самую дешёвую. И было бы хорошо проверить его на растворе с известным значением TDS.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Kh и Gh - тесты на временную и постоянную жесткость
        </h2>

        <p>
          Вода имеет огромное значение в аквариуме с растениями. Этим часто пренебрегают или просто не осознают важности
          данного фактора. "Ну вода и вода, налил из крана и порядок" — нет, это совершенно не так. Вода содержит очень
          большое количество элементов, которые могут быть как полезны, так и вредны растениям и живности.
        </p>

        <p>
          Одним из первостепенных показателей является жесткость воды: постоянная и временная. Постоянная жесткость
          (Gh — General hardness) — это соли кальция и магния. Временная (Kh — Carbonate hardness)
          — количество гидрокарбонатов. Большинство аквариумных растений предпочитают мягкую воду в диапазоне 5-8 Gh.
        </p>

        <p>
          В случае с водопроводной водой, возможно, вам не обойтись без тестов на Gh и Kh. С осмосной водой
          (обессоленной, с Kh и Gh, равными нулю) всё понятно — мы сами создаём состав воды по своему желанию, исходя из
          расчётов и рекомендаций. Главное не ошибиться с реминерализацией. А с водопроводной водой, если нет знакомых
          аквариумистов, данных от водоканала или просто не у кого спросить, придётся приобрести тесты на Kh и Gh. Но
          они вам понадобятся всего лишь один раз, да и стоимость у них относительно невысокая.
        </p>

        <p>
          Жесткость воды обычно сильно не меняется. Возможны сезонные колебания, но они, как правило, не очень
          значительны и не должны сильно вредить растениям. Однако если вода существенно меняется в разные сезоны, то о
          стабильности в аквариуме не может быть и речи — тут уже без системы обратного осмоса не обойтись.
        </p>

        <p class="font-italic">
          Какой возможен вред от этих двух тестов?
        </p>

        <p>
          Главное, чего не следует делать, имея тесты на жесткость, — это раскачивать аквариум постоянным изменением
          состава воды. Например, если вы разбавляете водопроводную воду осмосом или используете осмос с
          реминерализатором и при этом регулярно проверяете жесткость, то можете столкнуться с тем, что тесты от недели
          к неделе показывают разные значения. В таком случае неопытный аквариумист пытается "выровнять" жесткость,
          досыпая или уменьшая количество реминерализатора, или изменяя пропорцию разбавления осмосом, если речь идёт о
          водопроводной воде.
        </p>

        <p>
          Но разница в показаниях может быть просто погрешностью измерения, ошибкой теста или неправильным проведением
          анализа. Тест вовсе может оказаться бракованным. Таким образом, вы создаёте колебания параметров воды в
          аквариуме и тем самым ухудшаете условия для растений и гидробионтов.
        </p>

        <p>
          В такой ситуации лучше немного ошибиться с подбором параметров (насыпать чуть меньше или больше
          реминерализатора), но при этом использовать одно и то же количество от подмены к подмене. Пусть будет не 8 Gh,
          а 9 или 7, но вы будете поддерживать стабильное значение на постоянной основе.
        </p>

        <p>
          Не могу сказать, что колебания жесткости в небольшом диапазоне — это серьёзная проблема, но всё же лучше этого
          избегать.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Si - тест на кремний
        </h2>

        <p>
          Необходимость в тесте на кремний связана лишь с несколькими причинами: исключительно плохое качество воды,
          непригодный грунт или проблемные декорации в аквариуме. Это те факторы, с которыми нужно разобраться на старте
          аквариума — а именно, изучить свою воду и не добавлять в аквариум сомнительные материалы.
        </p>

        <p>
          Положительный момент в том, что случаи настолько плохой воды встречаются довольно редко. А грунт и декорации
          вы можете проконтролировать самостоятельно.
        </p>

        <p>
          Диатомовые водоросли — это обычное явление для нового аквариума. Зачастую они появляются между второй и
          третьей неделей, и аквариум сам справится с ними либо с помощью улиток и рыбок.
        </p>

        <p>
          Но если они появились заметно раньше — на первой неделе — и не уходят более месяца, тогда можно предпринимать
          дополнительные действия, вплоть до перезапуска аквариума и замены грунта или смены источника воды. Ошибаться
          нормально. Если вы хотите по-настоящему освоить это хобби, вам придётся запустить не менее десятка аквариумов.
          Я сам совсем недавно ошибся с камнями, и через два месяца пришлось перезапускать систему. Убрав проблемные
          камни, я сразу решил проблему с бурыми водорослями.
        </p>

        <NuxtImg
          src="/images/no-tests/diadoms.jpeg"
          class="full-width-image mb-4"
          loading="lazy"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
        />

        <p>
          Поэтому, если вы приобретёте тест в такой ситуации, ничего страшного не произойдёт. Он не заставит вас сделать
          что-то критически неправильное. Главное, чтобы не случилось такого, когда бурые водоросли в данный момент
          присутствуют закономерно, а вы, купив тест, получите завышенные значения из-за его низкого качества или брака,
          и на этом основании перезапустите аквариум без необходимости.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Ph - тест на кислотность воды
        </h2>

        <p>
          Тест на pH - практически бесполезный тест. Знание этого параметра вам ничего не дает. Вообще pH - это
          кислотность воды. Растения любят pH ниже 7 - слабокислую воду. Многие измеряют pH водопроводной воды и
          говорят, что pH у воды такой-то. Видят высокий pH и по совету неопытных людей из интернета начинают добавлять
          разные кислоты, чтобы понизить pH. Особенно смешно иногда получается с ортофосфорной кислотой. В попытках
          уменьшить pH аквариумист постепенно повышает фосфат в аквариуме до очень высоких значений, при этом pH в
          аквариуме через небольшое время будет возвращаться к исходному значению. А от фосфата вам придется
          избавляться не один месяц, т.к. он очень сильно впитывается в грунт.
        </p>

        <p>
          У воды нет самостоятельного показателя pH. Стоит вам немного добавить углекислого газа в воду, и вот pH уже
          снижается. pH - это результативный признак. Растения будут расти не от низкого pH, а от наличия CO2. А если
          есть газ, то и pH будет низким. Чувствуете логику? Где причина, а где следствие?
        </p>

        <p>
          Если Kh адекватный (от 0 до 6), то при подаче газа pH в любом случае будет ниже 7. Если у вас Kh высокий
          и вы подаете газ,
          то pH тоже будет высоким. Если Kh нормальный, то при правильной подаче газа pH в любом случае
          будет в диапазоне от 5.5 до 7. Какой смысл его измерять? Нет оптимальных значений, при которых растения будут
          расти лучше, или удобрений, которые при pH 6.5 будут усваиваться лучше. Современные фирменные удобрения
          выдерживают большой диапазон pH благодаря сильным хелаторам.
        </p>

        <p>
          На своем опыте я не видел корреляции между pH и ростом растений. Тут скорее прямая корреляция между
          концентрацией CO2 и ростом растений.
        </p>

        <p>
          Некоторые авторы предупреждают, что при изменении pH на величину больше 0.5 в течение дня могут погибнуть
          гидробионты. Но на самом деле здесь нужно смотреть на вопрос шире.
        </p>

        <p>
          Большинство рыбок, которые принято использовать в аквариумах-травниках с CO2, хорошо переносят изменения pH за
          2-3 часа (время от включения газа до установления максимального значения) на 1-1.5 единицы. Такие изменения
          встречаются даже в природе. Разнообразные тетры, например неоны или аманды, хорошо живут в кислой воде. Но
          моллинезий или гуппи лучше в таких аквариумах не содержать. Они предпочитают нейтральную или слабощелочную
          воду со средними параметрами жесткости. Поэтому при покупке живности лучше узнать об условиях содержания тех
          или иных видов.
        </p>

        <p>
          Раз уж зашла речь о живности в аквариуме-травнике, то я бы хотел дать один совет: не увлекайтесь покупкой
          дорогой живности в большом количестве. Вы будете совершать ошибки по неопытности, примите это как факт.
          Когда-нибудь вы перельете удобрения, добавите избыточное количество сайдекса или перекиси, перегреете аквариум
          или перегазуете, будете делать очень большие и частые подмены, очень часто пересаживать растения, давать очень
          мощный свет и тем самым создавать избыточный стресс для гидробионтов. Они могут даже выпрыгивать из аквариума.
          Часть или вся живность может погибнуть. И переживать лишний раз или менять условия в аквариуме из-за живности
          может стать очень неприятным моментом.
        </p>

        <p>
          У вас и так будет целый ворох проблем, связанных с выращиванием растений. Лучше сосредоточиться сначала на
          этом. А уже когда станет лучше получаться поддерживать стабильные параметры в аквариуме и меньше стрессовать
          живность, тогда можно будет покупать более дорогие и редкие виды. А для начала бесплатных катушек, дешевых
          неокардин или рыбок от местных разводчиков будет вполне достаточно для помощи в чистке аквариума.
        </p>

        <p>
          Очень хорошо о pH написал
          <a
            target="_blank"
            href="https://www.2hraquarist.com/blogs/hot-topics"
          >Денис Вонг.</a>
          Единственная польза, которую можно извлечь из теста на pH - это
          настройка газа. Но тут можно обойтись и без этого, просто настраивая газ по поведению гидробионтов, как
          это рекомендуют в своих статьях компания ADA.
        </p>

        <p>
          Какой потенциальный вред может быть от теста на pH? Допустим, измерение pH показало завышенный уровень. Вы
          будете думать, что pH слишком высок для выращивания растений, и в таком случае неопытный аквариумист может
          последовать совету налить кислоты в аквариум, добавить чрезмерно большое количество газа или предпринять
          какое-либо другое действие, дестабилизирующее аквариум.
        </p>

        <p>
          Еще один пример, только уже для увеличения pH. Есть мнение, что удобрения (в основном это касается
          микроудобрений и железа) усваиваются лучше при pH около 6.7. И вот вы делаете измерение, и pH-тест показал
          значение 6.3. Какие ваши действия? В голову приходит вариант уменьшить количество газа и тем самым повысить
          pH. Но в таком случае, если при pH 6.3 живность себя чувствовала хорошо, и вы уменьшаете подачу газа, то
          потенциально в погоне за усвоением удобрений вы намеренно уменьшаете концентрацию CO2 в воде, который является
          элементом номер один для роста растений. Получается, что вы идете в обратном направлении, когда в то же время
          растительная аквариумистика стремится к тому, чтобы концентрация была как можно больше.
        </p>

        <p>
          Хорошо, вы скажете: "Ну тогда нужно повысить Kh! И тем самым при одной и той же подаче и концентрации газа в
          воде pH повысится" (пренебрежем гидрокарбонатным равновесием, так как оно не будет значительно смещаться в
          данном диапазоне pH). Да, так и есть. Но если у вас Kh равен 0 для выращивания Тонин, или вы выращиваете
          Роталу Валлихи с максимальным Kh 3? Как быть в этом случае?
        </p>

        <p>
          Или вот еще задача: что если у вас грунт типа soil, и он даже без газа подкисляет воду до pH 6.5? А при подаче
          газа pH стремится вообще к 6 и ниже. Как быть в таком случае?
          При этом аквариумы на soil выглядят зачастую значительно лучше, и выращивать растения в них проще.
        </p>

        <p>
          Ответ простой: не нужно ничего выравнивать. Ваши удобрения выдержат любой разумный диапазон pH, и такими
          корректировками вы сделаете только хуже. В конечном итоге успех будет зависеть не от этого, а от более важных
          составляющих в аквариуме.
        </p>

        <p>
          Вполне возможно, что лимитирование по газу будет более выгодно для вашего аквариума, и достижение максимальной
          концентрации не лучший вариант. Такая ситуация возможна, когда химия воды не очень хорошая, чрезмерно много
          света или по каким-либо причинам питание не может усваиваться в большей степени, чем сейчас. Но именно газ не
          давал растениям расти быстрее, и питания в такой ситуации хватало. Давая больше газа, вы ослабляете
          ограничивающий фактор, но не устраняете проблему с питанием, и в такой ситуации растениям может стать хуже. Я
          наблюдал такое в своих аквариумах из-за плохого грунта или дисбаланса по удобрениям. Это может стать хорошим
          объяснением причины ухудшения растений при увеличении CO2, но также и поводом задуматься: а всё ли правильно
          настроено в аквариуме?
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Дропчекер
        </h2>

        <p>
          Дропчекер — это небольшой прозрачный похожий на каплю резервуар с синей или зеленой жидкостью.
          Реже с желтой. Он ближайший родственник pH-теста и нужен для определения концентрации CO2 в воде.
        </p>

        <p>
          Сложно представить, какой вред он может нанести. Но есть нюансы. Так же как и в случае с pH-тестом, он может
          создавать неправильное представление о количестве углекислого газа в воде.
        </p>

        <p>
          От производителя к производителю жидкость и форма самого устройства сильно отличаются. И индикация уровня CO2
          может существенно варьироваться.
        </p>

        <p>
          Показания сильно зависят от расположения дропчекера в аквариуме. И при хорошем распылении газа такого
          оптимального места может не быть вовсе. Мелкая пыль CO2 попадает в дропчекер и делает его более желтым,
          вследствие чего вы будете уменьшать количество газа и отдалять аквариум от оптимального состояния.
        </p>

        <p>
          Жидкость нужно менять на регулярной основе. Начинающий аквариумист может даже про это не знать.
        </p>

        <p>
          Дропчекер очень инертный. Он покажет значения равновесной концентрации газа только через 3-4 часа после того,
          как CO2 уже будет в пике. А пик, как мы помним, наступает через 2-3 часа после начала подачи газа.
          Это может создавать ложное впечатление, что газ накапливается в течение дня и к
          вечеру будет в критической точке, из-за чего гидробионты могут погибнуть. Нет, это не так. Если вы выставили
          хорошую подачу газа и создали сильное волнение на поверхности, то даже круглосуточная подача CO2 не навредит
          живности (в моем 35-литровом аквариуме у меня несколько раз ЭМК не отключал газ на ночь, и при 2 пузырьках в
          секунду никто в аквариуме не погиб). Это происходит потому, что растения не потребляют даже одного процента от
          общего количества газа. Почти весь CO2 просто выветривается. Таким образом, концентрация газа при свете и без
          света не будет отличаться практически ничем.
        </p>

        <p>
          Еще одно заблуждение заключается в том, что дропчекер защитит вашу живность от чрезмерного количества CO2. Но
          на самом деле, пока он отреагирует на повышение газа, все гидробионты уже отправятся к Нептуну. Я сам с этим
          сталкивался. Когда я заметил всю живность на поверхности воды, дропчекер был все еще зеленым.
        </p>

        <p>
          Даже у ADA рекомендация по подаче газа заключается в том, что нужно начинать с 1 пузырька в секунду на
          60-литровый аквариум и наблюдать за ростом растений, а не спрашивать дропчекер, который висит в углу
          аквариума. При любых манипуляциях с газом нужно находиться около аквариума и иметь возможность исправить
          ситуацию. К сожалению, бывает, что газ бесконтрольно повышается из-за неисправности оборудования, и обычно вас
          не будет рядом в этот момент.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          NH3 и NO2 - тесты на аммоний и нитрит
        </h2>

        <p>
          Здесь все очень просто — уделите внимание установлению азотного цикла. Эти элементы в любом случае будут
          присутствовать на запуске. И только время нужно, чтобы все яды стали перерабатываться в относительно
          безопасный нитрат. Никакие подмены вам не могут помочь в этот момент. Подмены снижают уровень яда,
          но не избавляют полностью.
        </p>

        <div class="d-flex justify-center">
          <NuxtImg
            src="/images/no-tests/nh3.webp"
            class="full-width-image mb-4"
            sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
            loading="lazy"
            :style="mdAndUp ? 'max-width: 80%;' : 'max-width: 100%;'"
          />
        </div>
        <p>
          Изображение взято из
          <a
            target="_blank"
            href="https://www.2hraquarist.com/blogs/hot-topics/filter-tank-cycling"
          >статьи</a>
          Дениса Вонга.
        </p>

        <p>
          Когда аквариум установил азотный цикл и вы не совершаете совсем грубых ошибок, таких как резкое переселение
          большого количества рыб, перекорм или плохая фильтрация, то показатели аммония и нитрита будут всегда на
          уровне 0.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Cu, Cl - тесты на медь и хлор
        </h2>

        <p>
          Будьте разумны в своих расходах. Главное — не используйте в аквариуме некачественные материалы для декораций
          или не пытайтесь сэкономить, используя очень дешевый грунт в аквариуме.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Fe - тест на железо
        </h2>

        <p>
          Этот тест я отнесу к бесполезным или потенциально вредным. Его вредность заключается, как и у любых тестов, в
          создании ложного впечатления контроля, лишней суеты и ошибочных выводах.
        </p>

        <p>
          Вроде бы хороша идея измерять железо и таким образом отслеживать динамику поглощения микроэлементов, так как
          обычно их дозируют по железу. Но железо — крайне нестабильный элемент в воде. Его стабильность повышают
          хелаторами. Но настроить измерение железа тестом в зависимости от типа используемого хелатора — это очень
          сложная и ненужная задача.
        </p>

        <p>
          С другой стороны, если вы решите дозировать микроэлементы, ориентируясь на показания теста железа, и сделаете
          вывод, что микроэлементы уже израсходованы и нужно добавить еще, то эта дорога приведет вас к передозировке
          микроэлементов, если вы значительно отклонитесь от рекомендаций производителя. А это самое опасное для
          растений — отравить их тяжелыми металлами.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          K - тест на калий
        </h2>

        <p>
          Сэкономлю вам много денег и времени. Про калий я подробно написал в
          <nuxt-link
            target="_blank"
            :to="localePath('/articles/potassium')"
          >
            другой статье.
          </nuxt-link>
          Если коротко, то на нейтральном грунте достаточно воспользоваться формулой:
        </p>

        <v-alert
          type="success"
          :icon="false"
          class="my-10 text-center"
        >
          [недельная дозировка калия] / [% подмены] × 100
        </v-alert>

        <p>
          Это даст вам равновесную концентрацию, та что установится через месяц-два, если вы будете поддерживать один и
          тот же режим подмен и дозировок.
        </p>

        <!--        <p>-->
        <!--          Вы также можете посмотреть динамику изменения калия на специальной странице,-->
        <!--          чтобы получить более детальное представление о том, как может меняться концентрация.-->
        <!--        </p>-->

        <p>
          На грунте типа soil это значение можете дополнительно разделить на 1.5-2, так как soil зачастую впитывает
          калий.
        </p>

        <p>
          Вы спросите: "Ну как же так? А растения же потребляют калий. Концентрация будет уменьшаться". Нет. Не
          потребляют — по крайней мере, в том количестве, которое может измерить тест, можно считать, что не потребляют.
          Хорошие тесты на калий имеют очень грубую шкалу измерения. И сколько я ни измерял, тест не показывает
          каких-либо изменений калия в течение недели на нейтральном грунте. А даже если растения и потребляют калий, то
          мы больше опасаемся передозировки, а не нехватки. И лучше недолить калия, чем перелить. Более подробно про
          нехватку калия и стратегию его дозирования я написал в
          <nuxt-link :to="localePath('/articles/potassium/')">
            этой статье.
          </nuxt-link>
        </p>

        <p>
          Откуда я знаю, что можно просто посчитать с помощью формулы или графика? Я сам делал тесты и сравнивал с
          графиком. И не только я. И не только магазинными тестами, но и лабораторными. Дарю вам мои знания!
        </p>

        <!-- TODO: дать ссылку на страницу с динамикой и добавить картинку -->
        <!--        <p>-->
        <!--          Добавить картинку графика.-->
        <!--        </p>-->

        <h2 class="title font-weight-regular text-h4 my-10">
          NO3 и PO4 - тесты на нитрат и фосфат
        </h2>

        <p>
          И вот мы добрались до самого корня зла 🙂
        </p>

        <p>
          Я буду рассматривать оба элемента, так как они чаще всего идут в паре в удобрениях, в обсуждениях и т.д.
        </p>

        <p>
          Что же опасного может быть в таких простых элементах? На самом деле ничего супер страшного нет, а вот в
          выводах аквариумиста относительно измерений тестами — есть.
        </p>

        <p>
          Опишу, как чаще всего используют тесты. Чаще всего аквариумисты считают нужным первым делом понять, сколько же
          в день потребляется нитрата и фосфата в их растительном аквариуме. И вот аквариумист берет тест на нитрат,
          делает измерение утром и делает измерение вечером, пытаясь потом посчитать дневное потребление. У этого
          действия есть несколько потенциальных проблем.
        </p>

        <p>
          Во-первых, точность тестов. Ни один тест на нитрат в широком потреблении не измерит точно вам разницу.
          Погрешность теста в лучшем случае 2-3 мг/л, а то и 5. На некоторых шкалах отметки находятся на значениях 0,
          10, 25. Как вам такая точность?
        </p>

        <p>
          Во-вторых, погрешность теста это не самое страшное. А самое страшное то, что тесты зачастую просто врут или
          вообще не работают.
        </p>

        <p>
          В-третьих, потребление аквариума может меняться и оно будет меняться. Тут есть зависимость от многих настроек
          в аквариуме или просто стрижек. Придется пересчитывать потребление, даже если вы его уже нашли и у вас
          получилось сделать это довольно точно.
        </p>

        <p>
          И вот представьте, что вы измерили утром 10 нитрата, а вечером у вас на шкале 5. Сколько вы добавите нитрата
          на следующий день? Наверное, попробуете добавить 5 нитрата. Добавляете удобрение до 10, измеряете вечером. А
          нитрата уже не 5, как ожидалось, а 10. "Ну значит не буду добавлять, так как аквариум не потребил ничего", —
          думаете вы. И вы то добавляете удобрения, то не добавляете. А ведь аквариуму нужна стабильность, любой опытный
          аквариумист вам это подтвердит.
        </p>

        <p>
          У моего знакомого тест показывал нитрат в водопроводе больше 20. Нетрудно догадаться, какой вывод он сделал —
          не нужно добавлять нитрат. И он добавлял один только фосфат. А росли только водоросли, а не растения. Но
          почему-то когда он начинал добавлять нитрат, то растения оживали. Интересный момент, не правда ли?
        </p>

        <p>
          Мало этого, тесты могут не работать совсем! И вы по своей неопытности будете верить показанию. Потому что у
          вас и мысли на данном этапе не может возникнуть, что тесты, которые сделали умные люди, могут не работать.
          Сколько аквариумистов в надежде увидеть заветную единицу фосфата видели прозрачную жидкость вместо голубой и
          начинали вливать фосфат как сумасшедшие, виня производителя удобрений в некачественности или думая, что
          аквариум потребляет столько удобрений!
        </p>

        <p>
          Узнали себя? Вы думаете: "Нужно же добавить удобрений!" Добавляете. Опять 0. "Нужно еще!"
          Добавляете еще больше! И так до тех пор, пока не появятся водоросли. Я сам на это попадался, с очень хорошим
          немецким тестом. А что говорить о дешевых!
        </p>

        <p>
          Живность, конечно, вряд ли вы отравите нитратом, но здоровья им это не прибавит.
          А бывает и наоборот. Нитрата нет, а тест показывает 10-15 мг/л. "Ну значит добавлять не нужно". А в это время
          растения начнут голодать и опять приходят водоросли.
        </p>

        <p>
          Тест на нитрат способен на многое. Вы можете его проверить на поверочном растворе. А следующее измерение через
          пару дней будет уже неправильным, потому что он просто испортился. Или может запросто показать в свежем осмосе
          10 нитрата, а в отстоявшемся том же самом осмосе 0. Чудеса.
        </p>

        <p>
          А еще становится интереснее, когда у аквариумиста две разные бутылки с нитратом и фосфатом, и он делает тесты
          на нитрат и фосфат в аквариуме. Ох уж тут начинается! Один тест показал одно, другой другое. Начинаем
          регулировать соотношение. А завтра измерения стали сильно отличаться ввиду вышесказанного, и опять одно
          добавляем, другое не добавляем.
        </p>

        <p>
          Пытаемся выровнять там что-то в аквариуме. А растения в это время перестают расти или ухудшаются, и всё тут.
        </p>

        <p>
          А если поставить вопрос с другой стороны:
        </p>

        <p>
          Почему мы в какой-то момент решили, что нужно тестировать нитрат и фосфат? Микроэлементы же вы не тестируете.
          А ответ простой: да просто потому, что такие тесты есть в магазине.
        </p>

        <p>
          А как же тогда добавлять удобрения, если я не знаю, сколько там чего и может возникнуть передозировка? Не
          возникнет. Если вы даете рекомендованную дозировку и делаете подмены. Поверьте, это надежнее, чем лезть со
          своим «знанием» из интернета и выравнивать. Можете взять рекомендации разных производителей, и чаще всего вы
          встретите дозировку по нитрату около 6-7, реже ближе к 10 мг/л в неделю.
        </p>

        <p>
          Да, дозировки не идеальны, но лучше, чем тесты тем, что вы их можете контролировать. Вы создаете постоянство в
          аквариуме, и растения в любом случае привыкнут. Да, какие-то не будут расти очень хорошо. Но лучше просто от
          таких видов избавиться. И даже нужно избавляться! Это нормально. Нельзя сделать всем хорошо. И у вас есть
          очень надежное средство против избытка удобрений — это подмены воды.
        </p>

        <p>
          "Но мне сказали, нужно иметь соотношение Редфилда в воде!" Не нужно. В удобрениях уже все учтено за вас, и то,
          как установится баланс в аквариуме, уже доверьте самой природе. Не думайте, что вы умнее производителя хороших
          и проверенных удобрений.
        </p>

        <p>
          Если вы думаете, что ваши растения голодают и их нужно подкормить, то вот мой аквариум при всего 6 мг/л
          нитрата в неделю:
        </p>

        <NuxtImg
          src="/images/no-tests/13.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />

        <h2 class="title font-weight-regular text-h4 my-10">
          Заключение
        </h2>

        <p>
          Я согласен, что проблема усугубляется тем, что куда бы вы ни пришли с вашей проблемой, первое,
          что у вас спросят: "А что показывают тесты?" Всё вас толкает к этому. Для этого я и пишу эту статью, чтобы не
          подталкивать вас на этот путь, а показать альтернативный способ содержания аквариума.
        </p>

        <p>
          Без тестов вы сосредотачиваетесь на других вещах и меньше беспокоитесь. Уделите внимание в первую очередь
          настройке аквариума в целом, а не тестам и удобрениям. Убедитесь, что:
        </p>

        <ul class="mb-4 ml-4">
          <li class="mb-2">
            мощность света правильная
          </li>
          <li class="mb-2">
            CO₂ достаточно
          </li>
          <li class="mb-2">
            вода хорошая
          </li>
          <li class="mb-2">
            нет никаких вредных материалов в аквариуме
          </li>
          <li class="mb-2">
            посажено достаточное количество растений
          </li>
        </ul>

        <p>
          И уже после этого возьмите удобрения и добавьте строго по рекомендации производителя.
        </p>

        <p>
          Управляйте тем, чем вы можете управлять. Не зарывайтесь слишком глубоко. Обычно проблема лежит где-то на
          поверхности. Это всё равно что залезть под капот машины и пытаться её починить до того, как вы научились
          ездить. Я предлагаю найти в аквариуме руль и педали и научиться ездить, а ремонт доверить профессионалам.
        </p>

        <p>
          Проблема подхода, связанного с измерениями, в том, что вы добьётесь успеха только тогда, когда изучите все
          аспекты. А это точно дано не каждому, и не каждый захочет этим заниматься. Вы готовы читать научные книги по
          ботанике, химии, физиологии растений и т. д.? А наблюдение за поведением растений — это то, что доступно
          каждому с первых дней существования аквариума. И ваша интуиция может давать результат гораздо быстрее.
        </p>

        <p>
          Кто-то может назвать такой подход антинаучным. Но я бы назвал его сугубо практичным. Вы сами видели аквариумы
          выше. Как-то же люди смогли добиться такой красоты? В аквариумистике можно говорить тысячи слов, но аквариум
          собеседника скажет за себя лучше.
        </p>

        <p>
          Сами подумайте, сколько всего можно изменить в аквариуме: свет, вода, CO₂, растения, живность, грунт, фильтр,
          декорации, удобрения — и сюда ещё мы добавляем тесты, которые являются очень ненадёжным звеном между вами и
          растениями. Просто решите для себя, а вам такая аквариумистика вообще нужна? Что вы хотите: больше любоваться
          аквариумом или бегать с пробирками вокруг него?
        </p>

        <p>
          Я вам честно скажу, что путь наблюдения за растениями долгий и порой болезненный, но с тестами вы просто
          будете ходить одними и теми же кругами год за годом и так ни к чему и не придёте.
        </p>

        <p>
          Вот примеры моих аквариумов, которые я содержал без тестов. Их полную историю вы можете посмотреть на моём
          <a
            target="_blank"
            href="https://www.youtube.com/@lapshinmr"
          >
            YouTube-канале.
          </a>
        </p>

        <NuxtImg
          src="/images/no-tests/14.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />

        <NuxtImg
          src="/images/no-tests/15.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />

        <p>
          Если у вас есть хотя бы 2 аквариума и вы используете тесты, то просто попробуйте не использовать тесты в одном
          из них. Хотя, это может быть очень сложно остановить себя схватиться за тесты в моменты, когда в аквариуме
          начались проблемы, если тесты лежат у вас на полке.
        </p>

        <p class="mt-6">
          Хотите обсудить статью? Переходите в наш
          <a
            href="https://t.me/samomes_calculator"
            target="_blank"
          >
            Telegram-канал.
          </a>
        </p>
      </v-col>
      <v-col
        cols="12"
        md="8"
        offset-md="2"
        class="d-flex justify-start mb-15"
      >
        <v-btn
          color="primary"
          :to="localePath('/articles/no-tests-part-1/')"
        >
          <v-icon>mdi-chevron-left</v-icon> Предыдущая <span class="hidden-xs-only">часть</span>
        </v-btn>
      </v-col>
    </v-row>
  </v-container>
</template>

<script lang="ts" setup>
const localePath = useLocalePath();
const { mdAndUp } = useDisplay();
const { t } = useI18n();

defineOptions({
  name: 'NoTestsPart2Page',
});

useSeoMeta({
  title: t('meta.articles.noTests2.title'),
  description: t('meta.articles.noTests2.description'),
  keywords: t('meta.articles.noTests2.keywords'),
});
</script>

<style lang="sass" scoped>
.post
  .post__title
    font-family: "Lexend", sans-serif !important
p
  margin-bottom: 16px
.full-width-image
  width: 100%
  object-fit: cover
  display: block
</style>
