<!--
  Samomes

  Copyright (C) 2025 Mikhail Lapshin

  This work is licensed under the Creative Commons Attribution-NonCommercial-ShareAlike 4.0
  International License. To view a copy of this license, visit
  http://creativecommons.org/licenses/by-nc-sa/4.0/ or send a letter to
  Creative Commons, PO Box 1866, Mountain View, CA 94042, USA.

  You are free to:
  - Share — copy and redistribute the material in any medium or format
  - Adapt — remix, transform, and build upon the material

  Under the following terms:
  - Attribution — You must give appropriate credit
  - NonCommercial — You may not use the material for commercial purposes
  - ShareAlike — If you remix, transform, or build upon the material,
    you must distribute your contributions under the same license as the original

  No warranties are given. The license may not give you all of the permissions
  necessary for your intended use.
-->

<template>
  <v-container class="post">
    <v-row>
      <v-col>
        <NuxtImg
          src="/images/no-tests/14.jpeg"
          class="full-width-image"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          :placeholder="[50, 25, 75, 5]"
        />
      </v-col>
    </v-row>
    <v-row>
      <v-col
        cols="12"
        sm="10"
        md="8"
        offset-sm="1"
        offset-md="2"
      >
        <v-btn
          color="primary"
          class="mr-0"
          square
          :to="localePath('/articles/')"
        >
          <v-icon>mdi-chevron-left</v-icon> Все статьи
        </v-btn>
      </v-col>
      <v-col
        cols="12"
        sm="10"
        md="8"
        offset-sm="1"
        offset-md="2"
      >
        <h1 class="text-h4 text-md-h3 mt-md-10">
          Тесты для аквариума вам не нужны. Часть 1
        </h1>
        <h2 class="title font-weight-regular mb-6">
          Общие слова и примеры аквариумов
        </h2>
        <div class="subtitle-2">
          Михаил Лапшин
        </div>
        <div class="subtitle-2 mb-10">
          21 мая 2025
        </div>

        <div class="d-flex flex-column align-center text-center text-gray font-italic my-10">
          <v-divider
            class="mb-10"
            style="width: 40%;"
          />
          <div class="mb-2">
            В память о нашем друге Сергее Ефремове.
          </div>
          <div>
            Твои знания и опыт продолжают жить в наших аквариумах.
          </div>
          <v-divider
            class="mt-10"
            style="width: 60%;"
          />
        </div>

        <p>
          Тихо-тихо! Не торопитесь с выводами. 🙂 Понимаю, что одним лишь заголовком мог настроить читателя определенным
          образом, но моя цель совсем в другом.
        </p>
        <p>
          В этой статье я хочу поделиться опытом содержания аквариума как с использованием тестов, так и без них —
          основываясь на собственной практике и опыте знакомых аквариумистов. Я постараюсь объяснить, в каких ситуациях
          тесты действительно полезны, а когда их применение может быть излишним или даже вредным.
        </p>
        <p>
          Можно долго дискутировать об этом в группах, чатах и на форумах, но в аквариумистике всё довольно прагматично.
          Достаточно увидеть аквариум, чтобы решить, стоит ли перенимать опыт его владельца. Фраза "у меня всё растёт" у
          каждого имеет своё наполнение — на вкус и цвет, как говорится, товарищей нет. Когда вы видите аквариум, вы
          сразу определяете для себя, соответствует ли он вашим эстетическим и практическим представлениям.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Примеры аквариумов
        </h2>

        <p>
          Давайте я приведу примеры аквариумов, владельцы которых сейчас не используют тесты, и покажу, какие изменения
          произошли после того, как они перестали их использовать.
        </p>

        <v-divider class="my-10" />

        <div>
          С тестами
        </div>
        <NuxtImg
          src="/images/no-tests/1.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />
        <div>
          Без тестов
        </div>
        <NuxtImg
          src="/images/no-tests/2.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />

        <p>
          Сергей. Н.Новгород. 150 литров. Опыт в растительной аквариумистике с газом 2 года.
        </p>

        <v-alert
          type="success"
          rounded="shaped"
          :icon="false"
          class="mb-6"
          variant="tonal"
        >
          <p>
            Это мой аквариум до использования тестов и приобретения необходимых знаний. После этого начались проблемы с
            водорослями, и я начал закупать тесты — целых 12 штук, плюс отдельно калий. Я менял показатели чуть ли не
            ежедневно и под эти результаты добавлял удобрения. Добавлял неграмотно: два дня мог активно вносить фосфаты,
            руководствуясь тестами, а потом три дня их не добавлял вообще (ведь по тестам его было слишком много). Можно
            долго описывать весь этот нелепый опыт с тестами.
          </p>
          <p>
            Сейчас уже не пользуюсь никакими тестами в течение как минимум года.
          </p>
        </v-alert>

        <v-divider class="my-10" />

        <div class="d-flex flex-column flex-md-row justify-md-space-between w-100 mb-2">
          <div
            class="d-flex flex-column"
            :style="mdAndUp ? 'width: 35%;' : 'width: 100%;'"
          >
            <div>
              С тестами
            </div>
            <NuxtImg
              src="/images/no-tests/3.jpeg"
              class="full-width-image mb-2 mb-md-0"
              quality="50"
              sizes="100vw sm:100vw md:35vw lg:35vw xl:35vw xxl:35vw"
              loading="lazy"
              style="height: 100%;"
            />
          </div>
          <div
            class="d-flex flex-column"
            :style="mdAndUp ? 'width: 63%;' : 'width: 100%;'"
          >
            <div>
              Без тестов
            </div>
            <NuxtImg
              src="/images/no-tests/4.jpeg"
              class="full-width-image mb-2 mb-md-0"
              quality="50"
              sizes="100vw sm:100vw md:63vw lg:63vw xl:63vw xxl:63vw"
              loading="lazy"
            />
          </div>
        </div>

        <p>
          Сергей. Домодедово. 96 л. 2 года.
        </p>

        <v-alert
          type="success"
          rounded="shaped"
          :icon="false"
          class="mb-6"
          variant="tonal"
        >
          <p>
            Глядя на фото "до" и "после", я с улыбкой вспоминаю, как тест показывал мне нулевой фосфат — и это при
            внесении удобрений строго по инструкции! Несложно догадаться, что я сделал дальше. Да, я начал повышать
            содержание фосфата (ведь он якобы отсутствовал). Добавлял его до тех пор, пока тест не среагировал, а когда
            среагировал — сразу показал темно-синюю жидкость.
          </p>
          <p>
            Я не поверил: как возможно пройти путь от нуля до зашкаливающих значений? Сделал тест ещё раз — он показал
            значение 1. Странно? Вовсе нет! Как я позже понял, один и тот же тест, проведённый несколько раз подряд,
            может показывать совершенно разные результаты. А я тем временем концентрировался исключительно на этих
            цифрах, а не на реальном состоянии растений.
          </p>
          <p>
            Итог: тесты постоянно сбивали меня с толку. Я безмерно рад, что меня уговорили попробовать обходиться без
            них. Сейчас, даже при возникновении вспышек водорослей, я не прибегаю к тестам. Они не дают по-настоящему
            полезной информации.
          </p>
        </v-alert>

        <p>
          У Сергея есть свой <a
            target="_blank"
            href="https://www.youtube.com/@SergeyZb"
          >YouTube-канал</a>, где вы можете более подробно узнать о жизни его аквариума.
        </p>

        <v-divider class="my-10" />

        <div class="d-flex flex-column flex-md-row justify-md-space-between w-100 mb-2">
          <div
            class="d-flex flex-column"
            :style="mdAndUp ? 'width: 49%;' : 'width: 100%;'"
          >
            <div>
              С тестами
            </div>
            <NuxtImg
              src="/images/no-tests/5.jpeg"
              class="full-width-image mb-2 mb-md-0"
              quality="50"
              sizes="100vw sm:100vw md:49vw lg:49vw xl:49vw xxl:49vw"
              loading="lazy"
            />
          </div>
          <div
            class="d-flex flex-column"
            :style="mdAndUp ? 'width: 49%;' : 'width: 100%;'"
          >
            <div>
              Без тестов
            </div>
            <NuxtImg
              src="/images/no-tests/6.jpeg"
              class="full-width-image mb-2 mb-md-0"
              quality="50"
              sizes="100vw sm:100vw md:49vw lg:49vw xl:49vw xxl:49vw"
              loading="lazy"
              style="height: 100%;"
            />
          </div>
        </div>

        <p>
          Денис. С.Петербург. 60 л. Опыт 1 год
        </p>

        <v-divider class="my-10" />

        <div class="d-flex flex-column mb-2">
          <div>
            С тестами
          </div>
          <NuxtImg
            src="/images/no-tests/7.jpeg"
            class="full-width-image mb-2"
            quality="50"
            sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
            loading="lazy"
          />
        </div>
        <div class="d-flex flex-column mb-2">
          <div>
            Без тестов
          </div>
          <NuxtImg
            src="/images/no-tests/8.jpeg"
            class="full-width-image mb-2"
            quality="50"
            sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
            loading="lazy"
          />
        </div>

        <p>
          Александр. Поселок Горки Ленинские. 96 л. Опыт 7 лет.
        </p>

        <v-alert
          type="success"
          rounded="shaped"
          :icon="false"
          class="mb-6"
          variant="tonal"
        >
          Тестов у меня было половина тумбочки — JBL и Нилпа. Было всё: на нитраты, фосфаты, калий, аммиак и прочее.
          По тестам водопроводная вода показывала нитраты на уровне 25-30 мг/л, поэтому я добавлял только
          фосфаты, полагая, что нитратов и так достаточно из водопровода. В результате ничего толком не росло.
        </v-alert>

        <v-divider class="my-10" />

        <p>
          Вот еще несколько отличных примеров аквариумов, хотя и без сравнения "до и после". Тем не менее, они прекрасно
          демонстрируют, что можно создать и поддерживать красивый и здоровый аквариум без использования тестов.
        </p>

        <v-divider class="my-10" />

        <NuxtImg
          src="/images/no-tests/9.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />
        <NuxtImg
          src="/images/no-tests/10.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />

        <p>
          Татьяна, С.Петербург. 100 л. Опыт 1 год.
        </p>

        <v-alert
          type="success"
          rounded="shaped"
          :icon="false"
          class="mb-6"
          variant="tonal"
        >
          <p>
            Для себя я сразу поняла, что не хочу заморачиваться с тестами и глубоко вникать в химию воды. Травник был
            нужен прежде всего для красоты, как элемент дизайна в спальне — чтобы приносил удовольствие и при этом не
            требовал много времени на обслуживание.
          </p>
          <p>
            Я выбрала медленный старт, без резких изменений. Параметры увеличивала постепенно, поскольку моя философия в
            содержании аквариума — это стабильность. Изначально сделала тесты только на Gh и Kh, чтобы понять состав
            воды из крана. Вода у нас мягкая, поэтому я реминерализую её до 8 Gh, используя ювелирные весы при каждой
            подмене. Также иногда пользуюсь TDS-метром.
          </p>
          <p>
            За почти два года существования аквариума у меня ни разу не было проблем с водорослями. Я стараюсь наблюдать
            за растениями и оценивать, как они реагируют на увеличение удобрений, света или CO₂. Удобрения вношу по
            рекомендации производителя и с помощью калькулятора "Самомес".
          </p>
        </v-alert>

        <v-divider class="my-10" />

        <NuxtImg
          src="/images/no-tests/11.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />

        <p>
          Сергей. Нижний Новгород. 45 л. Опыт 3 года
        </p>

        <v-divider class="my-10" />

        <NuxtImg
          src="/images/no-tests/12.jpeg"
          class="full-width-image mb-2"
          quality="50"
          sizes="100vw sm:100vw md:100vw lg:100vw xl:100vw xxl:100vw"
          loading="lazy"
        />

        <p>
          Артем. Москва. 30 л. Опыт 2 года
        </p>

        <p>
          У Артема есть свой
          <a
            target="_blank"
            href="https://www.youtube.com/@volkovartem86"
          >YouTube-канал</a>,
          где вы можете задать ему вопросы о его аквариуме напрямую.
        </p>

        <v-divider class="my-10" />

        <p>
          Все эти люди — обычные аквариумисты-любители, а не профессионалы. И вы вполне можете встретить их аквариумы в
          социальных сетях.
        </p>
        <p>
          Особенно интересно то, что представленные аквариумы созданы на нейтральных грунтах, совсем без корневого
          питания! Почему я делаю на этом акцент? Потому что с корневым питанием выращивать растения еще проще. А в
          показанных примерах присутствуют растения совершенно разного уровня сложности содержания.
        </p>

        <p>
          Вы можете возразить: "Тут свет RGB, прошло время, человек стал более опытным, композиция улучшилась и т.д."
          Но я отвечу следующее: "Вот именно! Без тестов аквариумист сосредоточился не на плясках вокруг
          параметров воды, а на дизайне аквариума и других действительно важных настройках. Он начал мыслить совсем
          другими шаблонами."
        </p>
        <p>
          Интересно? Тогда идем дальше.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Исходные данные
        </h2>

        <p>
          Давайте сразу определим, для кого предназначена эта статья:
        </p>

        <ul class="ml-4">
          <li class="mb-2">
            Вы аквариумист с небольшим опытом, но уже обладаете базовыми знаниями и предпринимали определенные попытки
            в этом хобби
          </li>
          <li class="mb-2">
            В вашем аквариуме используется CO₂ (углекислый газ)
          </li>
          <li class="mb-2">
            Речь не идет о содержании редких видов креветок, требующих особых условий или крайне низкого уровня нитратов
          </li>
          <li class="mb-2">
            Возможно, вы сталкиваетесь с проблемой водорослей
          </li>
          <li class="mb-2">
            Вы уже долгое время используете тесты, но результат оставляет желать лучшего
          </li>
          <li class="mb-2">
            Возможно, вы чувствуете, что застряли в определенных рамках содержания аквариума и ищете альтернативный
            подход, потому что что-то идет не так, или просто устали регулярно проводить тестирование воды
          </li>
        </ul>

        <p>
          Если хотя бы часть этих пунктов отражает вашу ситуацию, то эта статья может оказаться вам полезной.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          Важное отступление
        </h2>

        <p>
          Сразу хочу сделать важное замечание: если у вас получается успешно содержать аквариум с использованием тестов,
          я не имею права вас отговаривать. Если вы разобрались в большинстве аспектов и/или у вас всё хорошо — не стоит
          менять то, что работает.
        </p>
        <p>
          Более того, я пишу этот текст без всякого назидания, а лишь как описание альтернативного варианта содержания
          растительного аквариума. Моя цель — показать, что можно обходиться без тестов и при этом иметь фантастически
          красивый аквариум.
        </p>
        <p>
          Я не отрицаю, что в чьей-то практике могут успешно применяться те или иные тесты, сосуществуя с прекрасным
          аквариумом. Но для этого необходимы хорошая осознанность и терпение, чтобы тесты не диктовали вам свою волю. А
          именно это зачастую и происходит.
        </p>
        <p>
          Я сам был из тех, кто при любом сомнительном моменте хватался за тесты, вместо того чтобы наблюдать за
          аквариумом и более пристально следить за поведением растений — напрямую связывать свои действия с их откликом.
          Иногда доходило до смешного: когда всё было хорошо, но тесты показывали какое-то несоответствие, я начинал "на
          всякий случай" менять условия, поскольку это не совпадало с общепринятыми рекомендациями. И таких
          аквариумистов, как я, немало.
        </p>
        <p>
          Поэтому в определённый момент я решил убрать все тесты и полностью полагаться на то, что действительно могу
          контролировать: основное оборудование аквариума, качество воды, подбор растений, дозировки удобрений,
          наблюдение за растениями и живностью, и в какой-то степени — интуицию. В моём случае, если тесты лежат в
          тумбочке, они обязательно будут использованы.
        </p>

        <h2 class="title font-weight-regular text-h4 my-10">
          В целом о тестах
        </h2>

        <p>
          Не было бы ничего плохого в тестах, если бы они не давали повода лишний раз вмешиваться и мешать аквариуму
          развиваться в созданных вами условиях. Одно дело — измерить нитраты для подтверждения своих догадок, чтобы
          исключить явный просчет. И совсем другое — следовать указаниям тестов и вносить изменения там, где из-за
          неопытности можно больше навредить, чем помочь.
        </p>

        <p>
          С тестами вы пытаетесь найти некое "золотое сечение", надеясь, что это обеспечит процветание всех растений и
          красоту аквариума. Вы полагаетесь на то, что тесты подскажут вам правильный путь.
        </p>

        <p>
          Представьте: вы измерили какой-то параметр, и результат вам не понравился. Именно здесь начинаются бесконечные
          эксперименты с удобрениями, томительное ожидание и головная боль от аквариума. А ему в этот момент было бы
          лучше, если бы вы просто взяли чашку чая, спокойно посидели рядом и внесли удобрения согласно рекомендациям
          производителя.
        </p>

        <p>
          Не зря опытные аквариумисты утверждают: "Чем дальше аквариумист от аквариума, тем лучше аквариуму".
        </p>

        <p>
          Давайте зададимся другим вопросом. Какие значения на самом деле правильные для вашего конкретного аквариума?
          Кто вам это скажет? Тесты? Нет, не скажут. Остановитесь не на долго и подумайте над этим.
        </p>

        <p>
          К тому же тесты отнимают деньги и время — это факт. Даже еженедельное тестирование расточительно, учитывая
          динамичный образ жизни современного человека! Поначалу процесс "игры в лаборанта" может увлекать, но вскоре он
          превратится в рутину. При этом полный набор даже самых недорогих тестов — уже не такая уж дешевая покупка. За
          эти деньги вы могли бы приобрести половину, если не целую упаковку питательного грунта или линейку
          качественных удобрений. И это было бы гораздо лучшим вложением средств.
        </p>

        <p>
          Я сам помню вечера пятниц, когда доставал специальную коробку с тестами и с важным видом проводил измерения
          в двух-трех аквариумах. Мне казалось, что именно так я контролирую параметры и делаю аквариум лучше. Я тратил
          час, а то и больше времени на измерения и анализ данных. Моя голова постоянно была загружена только этими
          цифрами. Но улучшений в аквариуме почему-то не наблюдалось. Мои аквариумы постоянно находились в режиме
          адаптации к меняющимся параметрам. Я был уверен, что вот-вот найду идеальные условия. Но за два с половиной
          года так и не обнаружил их.
        </p>

        <p>
          В дополнение ко всему вышесказанному: тесты еще нужно регулярно проверять на эталонных растворах! Их
          необходимо либо приготовить, либо купить и потратить дополнительное время на калибровку теста, чтобы просто
          убедиться в его работоспособности. И эту процедуру следует проводить регулярно, поскольку нет гарантии, что
          через неделю тест не придет в негодность.
        </p>

        <p>
          Данная статья получилась довольно объемной, поэтому было решено разбить ее на две части. В
          <nuxt-link :to="localePath('/articles/no-tests-part-2/')">
            следующей части
          </nuxt-link> я
          детально разбираю каждый тест по отдельности. Жду вас на следующей странице!
        </p>

        <p class="mt-6">
          Хотите обсудить статью? Переходите в наш
          <a
            href="https://t.me/samomes_calculator"
            target="_blank"
          >
            Telegram-канал.
          </a>
        </p>
      </v-col>
      <v-col
        cols="12"
        sm="10"
        md="8"
        offset-sm="1"
        offset-md="2"
        class="d-flex justify-space-between my-15"
      >
        <v-btn
          color="primary"
          :to="localePath('/articles/potassium/')"
        >
          <v-icon>mdi-chevron-left</v-icon> Предыдущая <span class="hidden-xs-only">статья</span>
        </v-btn>
        <v-btn
          color="primary"
          :to="localePath('/articles/no-tests-part-2/')"
        >
          Продолжение <span class="hidden-xs-only">статьи</span> <v-icon>mdi-chevron-right</v-icon>
        </v-btn>
      </v-col>
    </v-row>
  </v-container>
</template>

<script lang="ts" setup>
const localePath = useLocalePath();
const { mdAndUp } = useDisplay();
const { t } = useI18n();

defineOptions({
  name: 'NoTestsPart1Page',
});

useSeoMeta({
  title: t('meta.articles.noTests1.title'),
  description: t('meta.articles.noTests1.description'),
  keywords: t('meta.articles.noTests1.keywords'),
});
</script>

<style lang="sass" scoped>
.post
  .post__title
    font-family: "Lexend", sans-serif !important
p
  margin-bottom: 16px
.full-width-image
  width: 100%
  object-fit: cover
  display: block
</style>
